// Напишите программу, которая на вход принимает одно число
//    (N), а на выходе показывает все целые числа в промежутке от -N до N.

Console.Write("Enter a number 1: ");
int b1 = int.Parse(Console.ReadLine()!);
int count = 0;

while (count != b1) 
    Console.WriteLine("Yes");
else
    Console.WriteLine("No");